/********************************************
*文件名：fifo_read.c
*创建者：焦点
*创建时间：2019-4-5
*文件说明：有名管道通信
*********************************************/
#include<signal.h>
#include<sys/types.h>
#include<stdio.h>


/********************************************
*函数名：int kill(pid_t pid, int sig)
*参数：pid：接收信号的进程号
	   sig：要发送的信号
*返回值：成功：0
	     失败：-1
*函数功能：向进程发送信号
*********************************************/

void main(int argc,char*(argv[]))
{
	pid_t pid;
	
	//传递‘kill’的第 2 个参数时将指针赋给整数，未作类型转换
	pid = atoi(argv[1]);
	
	kill(pid,SIGINT);
}
